Repository: deon-gracias/code-crush
Catalog: plant-disease-detector/lib/l10n/app_*.arb
Languages: hi, mr, ta

# appName
source: Plant Disease Detector
hi: संयंत्र रोग डिटेक्टर
mr: वनस्पती रोग शोधक
ta: தாவர நோய் கண்டறிதல்

source: Instructions
hi: निर्देश
mr: सूचना
ta: வழிமுறைகள்

# instruction1
source: Take/Select a photo of an affected plant by tapping the camera button below
hi: नीचे दिए गए कैमरा बटन पर टैप करके किसी प्रभावित पौधे की फ़ोटो लें/चयन करें
mr: खालील कॅमेरा बटण टॅप करून प्रभावित रोपाचा फोटो घ्या/निवडा
ta: கீழே உள்ள கேமரா பொத்தானைத் தட்டுவதன் மூலம் பாதிக்கப்பட்ட தாவரத்தின் புகைப்படத்தை எடுக்கவும்/தேர்ந்தெடுக்கவும்

# instruction2
source: Give it a short while before you can get a suggestion of the disease
hi: इससे पहले कि आप रोग का सुझाव प्राप्त कर सकें, इसे थोड़ी देर दें
mr: तुम्हाला रोगाची सूचना मिळण्यापूर्वी थोडा वेळ द्या
ta: நோயைப் பற்றிய ஆலோசனையைப் பெறுவதற்கு சிறிது நேரம் கொடுங்கள்

source: Your History
hi: आपका इतिहास
mr: तुमचा इतिहास
ta: உங்கள் வரலாறு

# nothing
source: Nothing to Show
hi: दिखाने के लिए कुछ नहीं
mr: दाखवण्यासाठी काहीही नाही
ta: காட்ட எதுவும் இல்லை

# takePhoto
source: Take a Photo
hi: एक तस्वीर लें
mr: फोटो काढ
ta: புகைப்படம் எடு

# selectPhoto
source: Select a Photo
hi: एक फोटो चुनें
mr: एक फोटो निवडा
ta: ஒரு புகைப்படத்தைத் தேர்ந்தெடுக்கவும்

# okay
source: Crops are okay
hi: फसल ठीक है
mr: पिके ठीक आहेत
ta: பயிர்கள் பரவாயில்லை

# case1
source: Pepper Bell Bacterial Spot
hi: काली मिर्च बेल बैक्टीरियल स्पॉट
mr: मिरपूड बेल जिवाणू स्पॉट
ta: பெப்பர் பெல் பாக்டீரியா ஸ்பாட்

# case1P
source: Caused by Xanthomonas bacteria, spread through splashing rain.
hi: Xanthomonas बैक्टीरिया के कारण, बारिश के छींटे से फैलता है।
mr: झेंथोमोनास बॅक्टेरियामुळे होतो, शिंपडणाऱ्या पावसामुळे पसरतो.
ta: Xanthomonas பாக்டீரியாவால் ஏற்படுகிறது, தெறிக்கும் மழை மூலம் பரவுகிறது.

# case1S
source: Spray early and often. Use copper and Mancozeb sprays.
hi: जल्दी और अक्सर स्प्रे करें। कॉपर और मैंकोजेब स्प्रे का इस्तेमाल करें।
mr: लवकर आणि अनेकदा फवारणी करा. तांबे आणि मॅन्कोझेब फवारण्या वापरा.
ta: ஆரம்ப மற்றும் அடிக்கடி தெளிக்கவும். செம்பு மற்றும் மான்கோசெப் தெளிப்புகளைப் பயன்படுத்தவும்.

# case2
source: Potato Early Blight
hi: आलू अर्ली ब्लाइट
mr: बटाटा लवकर अनिष्ट परिणाम
ta: உருளைக்கிழங்கு ஆரம்பகால ப்ளைட்

# case2P
source: The fungus Alternaria solani, high humidity and long periods of leaf wetness.
hi: कवक अल्टरनेरिया सोलानी, उच्च आर्द्रता और लंबे समय तक पत्ती का गीलापन।
mr: अल्टरनेरिया सोलानी बुरशी, जास्त आर्द्रता आणि पानांचा दीर्घकाळ ओलावा.
ta: ஆல்டர்னேரியா சோலானி என்ற பூஞ்சை, அதிக ஈரப்பதம் மற்றும் நீண்ட கால இலை ஈரத்தன்மை.

# case2S
source: Maintaining optimum growing conditions: proper fertilization, irrigation, and pests management.
hi: इष्टतम बढ़ती परिस्थितियों को बनाए रखना: उचित उर्वरीकरण, सिंचाई और कीट प्रबंधन।
mr: इष्टतम वाढणारी परिस्थिती राखणे: योग्य खत, सिंचन आणि कीटक व्यवस्थापन.
ta: உகந்த வளரும் நிலைமைகளை பராமரித்தல்: முறையான உரமிடுதல், நீர்ப்பாசனம் மற்றும் பூச்சி மேலாண்மை.

# case3
source: Pepper Bell Healthy
hi: काली मिर्च बेल स्वस्थ
mr: मिरपूड बेल निरोगी
ta: பெப்பர் பெல் ஆரோக்கியமானது

# case4
source: Potato Healthy
hi: आलू स्वस्थ
mr: बटाटा हेल्दी
ta: உருளைக்கிழங்கு ஆரோக்கியமானது

# case5
source: Tomato Bacterial Spot
hi: टमाटर बैक्टीरियल स्पॉट
mr: टोमॅटो जिवाणू स्पॉट
ta: தக்காளி பாக்டீரியா ஸ்பாட்

# case6
source: Potato Late Blight
hi: आलू लेट ब्लाइट
mr: बटाटा उशीरा अनिष्ट परिणाम
ta: உருளைக்கிழங்கு லேட் ப்ளைட்

# case6P
source: Occurs in humid regions with temperatures ranging between 4 and 29 °C.
hi: 4 से 29 डिग्री सेल्सियस के बीच तापमान वाले नम क्षेत्रों में होता है।
mr: 4 ते 29 °C च्या दरम्यान तापमान असलेल्या आर्द्र प्रदेशात आढळते.
ta: 4 முதல் 29 டிகிரி செல்சியஸ் வரை வெப்பநிலை கொண்ட ஈரப்பதமான பகுதிகளில் நிகழ்கிறது.

# case6S
source: Eliminating cull piles and volunteer potatoes, using proper harvesting and storage practices, and applying fungicides when necessary.
hi: उचित कटाई और भंडारण प्रथाओं का उपयोग करके, और आवश्यक होने पर फफूंदनाशकों को लागू करके, मुरझाए हुए बवासीर और स्वैच्छिक आलू को खत्म करना।
mr: बटाटे आणि स्वयंसेवी बटाटे काढून टाकणे, योग्य कापणी आणि साठवण पद्धती वापरणे आणि आवश्यक असल्यास बुरशीनाशकांचा वापर करणे.
ta: குல் பைல்ஸ் மற்றும் தன்னார்வ உருளைக்கிழங்குகளை நீக்குதல், சரியான அறுவடை மற்றும் சேமிப்பு நடைமுறைகளைப் பயன்படுத்துதல் மற்றும் தேவைப்படும்போது பூஞ்சைக் கொல்லிகளைப் பயன்படுத்துதல்.

# case7
source: Tomato Early Blight
hi: टमाटर अर्ली ब्लाइट
mr: टोमॅटो अर्ली ब्लाइट
ta: தக்காளி ஆரம்பகால ப்ளைட்

# case7P
source: The fungus Alternaria solani, high humidity and long periods of leaf wetness.
hi: कवक अल्टरनेरिया सोलानी, उच्च आर्द्रता और लंबे समय तक पत्ती का गीलापन।
mr: अल्टरनेरिया सोलानी बुरशी, जास्त आर्द्रता आणि पानांचा दीर्घकाळ ओलावा.
ta: ஆல்டர்னேரியா சோலானி என்ற பூஞ்சை, அதிக ஈரப்பதம் மற்றும் நீண்ட கால இலை ஈரத்தன்மை.

# case7S
source: Maintaining optimum growing conditions: proper fertilization, irrigation, and pests management.
hi: इष्टतम बढ़ती परिस्थितियों को बनाए रखना: उचित उर्वरीकरण, सिंचाई और कीट प्रबंधन।
mr: इष्टतम वाढणारी परिस्थिती राखणे: योग्य खत, सिंचन आणि कीटक व्यवस्थापन.
ta: உகந்த வளரும் நிலைமைகளை பராமரித்தல்: முறையான உரமிடுதல், நீர்ப்பாசனம் மற்றும் பூச்சி மேலாண்மை.

# case8
source: Tomato Healthy
hi: टमाटर स्वस्थ
mr: टोमॅटो हेल्दी
ta: தக்காளி ஆரோக்கியமானது

# case9
source: Tomato Late Blight
hi: टमाटर लेट ब्लाइट
mr: टोमॅटो लेट ब्लाइट
ta: தக்காளி லேட் ப்ளைட்

# case9P
source: Caused by the water mold Phytophthora infestans.
hi: वाटर मोल्ड फाइटोफ्थोरा इन्फेस्टन्स के कारण होता है।
mr: पाणी साचा Phytophthora infestans द्वारे झाल्याने.
ta: பைட்டோபதோரா இன்ஃபெஸ்டன்ஸ் என்ற நீர் பூஞ்சையால் ஏற்படுகிறது.

# case9S
source: Timely application of fungicide
hi: कवकनाशी का समय पर प्रयोग
mr: बुरशीनाशकाचा वेळेवर वापर
ta: பூஞ்சைக் கொல்லியை சரியான நேரத்தில் பயன்படுத்துதல்
